TexasInstruments/mspm0-sdk/examples/nortos/LP_MSPM0L2228/bsl/secondary_bsl_uart/secondary_bsl.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 */
// @cliArgs --device "MSPM0L222X" --package "LQFP-80(PN)" --part "Default" 
// @v2CliArgs --device "MSPM0L2228" --package "LQFP-80(PN)" 
// @cliArgs --board /ti/boards/LP_MSPM0L2228 --rtos nortos

/**
 * Import the modules used in this configuration.
 */
const NONMAIN       = scripting.addModule("/ti/driverlib/NONMAIN");
const ProjectConfig = scripting.addModule("/ti/project_config/ProjectConfig");

/**
 * Write custom configuration values to the imported modules.
 */
NONMAIN.staticWriteProtectionMainLow = 0xFFFF00FF;
NONMAIN.bslAltConfig                 = true;
NONMAIN.bslAltAddress                = 0x2041;
NONMAIN.nonmainWarning               = true;
NONMAIN.staticWriteProtectionNonMain = true;

ProjectConfig.genDisable = true;
